* 账本 样例

** 汇总
;;#+BEGIN_SRC ledger :cmdline -n bal :noweb yes
#+name: 账户总览
#+BEGIN_SRC ledger :cmdline -s bal :noweb yes
<<startup>>
<<income>>
<<inner_trans>>
<<outer_trans>>
<<expenses_202008>>
#+END_SRC

#+name: 按月汇总
#+BEGIN_SRC ledger :cmdline reg -M :noweb yes
<<startup>>
<<income>>
<<inner_trans>>
<<outer_trans>>
<<expenses_202008>>
#+END_SRC

#+RESULTS: 账户总览
#+begin_example
        -10000.00 元  其他: 初始金额
            19.00 元  收入
           -10.00 元     公众号
            31.00 元     投资
            -2.00 元     红包
            44.50 元  消费
             4.50 元     吃喝玩乐
            38.00 元     水电煤网
             2.00 元     群红包
          9936.50 元  账户
          -900.00 元     借贷
         -1000.00 元       小李: 借入
          -900.00 元       小王
         -1000.00 元         借入
           100.00 元         还借款
          1000.00 元       小赵
          3000.00 元         借出
         -2000.00 元         收还款
            10.00 元     微信
          7000.00 元     投资
          3000.00 元       股票
          4000.00 元       黄金
           -31.00 元     收益
           -50.00 元       股票
            19.00 元       黄金
           -40.50 元     欠款
           -38.00 元       建行信用卡
            -2.50 元       招行信用卡
          3898.00 元     现金
--------------------
                   0
#+end_example

#+RESULTS: 按月汇总
#+begin_example
20-Aug-01 - 20-Aug-31           其他: 初始金额         -10000.00 元 -10000.00 元
                                收入: 公众号              -10.00 元 -10010.00 元
                                收入: 投资                 31.00 元  -9979.00 元
                                收入: 红包                 -2.00 元  -9981.00 元
                                消费: 吃喝玩乐              4.50 元  -9976.50 元
                                消费: 水电煤网             38.00 元  -9938.50 元
                                消费: 群红包                2.00 元  -9936.50 元
                                账户: 借贷: 小李        -1000.00 元 -10936.50 元
                                账户: 借贷: 小王        -1000.00 元 -11936.50 元
                                账户: 借贷: 小赵         3000.00 元  -8936.50 元
                                账户: 微信                 10.00 元  -8926.50 元
                                账户: 投资: 股票         3000.00 元  -5926.50 元
                                账户: 投资: 黄金         4000.00 元  -1926.50 元
                                账户: 收益: 股票          -50.00 元  -1976.50 元
                                账户: 收益: 黄金           19.00 元  -1957.50 元
                                账户: 欠款: 建行信用卡    -38.00 元  -1995.50 元
                                账户: 欠款: 招行信用卡     -2.50 元  -1998.00 元
                                账户: 现金               1998.00 元            0
#+end_example


** 账户设置（你有哪些账户的）
#+name: startup
#+BEGIN_SRC ledger :noweb yes
2020/08/01 * 基础账户设置
    账户: 现金           10000.00 元
    账户: 微信               0.00 元
    账户: 欠款: 建行信用卡   0.00 元
    账户: 欠款: 招行信用卡   0.00 元
    其他: 初始金额
#+END_SRC

** 收入部分
#+name: income
#+BEGIN_SRC ledger :noweb yes
2020/08/09 * 领红包
    账户: 微信         2.00 元
    收入: 红包
2020/08/10 * 公众号赞赏
    账户: 微信          10.00 元
    收入: 公众号
2020/08/14 * 投资收益
    账户: 收益: 黄金   19.00 元
    收入: 投资
2020/08/14 * 投资收益
    账户: 收益: 股票  -50.00 元
    收入: 投资
#+END_SRC

** 转账或投资
#+name: inner_trans
#+BEGIN_SRC ledger :noweb yes
2020/08/10 * 转账
    账户: 微信                                  1000.00 元
    账户: 现金
2020/08/10 * 投资
    账户: 投资: 股票                            3000.00 元
    账户: 现金
2020/08/10 * 理财
    账户: 投资: 黄金                            4000.00 元
    账户: 现金
#+END_SRC


** 借还款
#+name: outer_trans
#+BEGIN_SRC ledger :noweb yes
2020/08/11 * 借小王
    账户: 微信                                 1000.00 元
    账户: 借贷: 小王: 借入
2020/08/11 * 借小李
    账户: 微信                                 1000.00 元
    账户: 借贷: 小李: 借入
2020/08/11 * 借给小赵
    账户: 借贷: 小赵: 借出                     3000.00 元
    账户: 微信
2020/08/13 * 小赵还钱
    账户: 现金                                 2000.00 元
    账户: 借贷: 小赵: 收还款
2020/08/14 * 给小王还钱
    账户: 借贷: 小王: 还借款                    100.00 元
    账户: 现金
#+END_SRC

** 日常开支
*** 2020 年日常开支
**** 2020 年 8 月开支
#+name: expenses_202008
#+BEGIN_SRC ledger :noweb yes
2020/08/12 描述: 矿泉水
    消费: 吃喝玩乐                         2.0 元
    账户: 现金
2020/08/12 * 红包
    消费: 群红包                            2.0 元
    账户: 微信
2020/08/13 * 可乐
    消费: 吃喝玩乐                          2.5 元
    账户: 欠款: 招行信用卡
2020/08/14 * 电费
    消费: 水电煤网        38 元
    账户: 欠款: 建行信用卡
#+END_SRC
